import { MagicType } from '../model/api.model';

export const texts = {
  wizardDescriptions: {
    [MagicType.Fire]: `Фандор прирождённый пиротехник! Он с детства любил огонь намного больше своих бровей и ресниц. А ещё он любит покушать и запах жареной курочки с панировкой всегда следует за ним.
Однажды он он приготовил своё фирменное блюдо какому-то вояке, а тот возьми и укради рецепт. Так появился Ростикс, а Фандор остался не у дел. <br /><br />

Может пробить щит мага <b class="text-slate-700">воздуха</b>.<br />
Получает усиление от мага <b class="text-slate-700">воздуха</b>.<br />
Беззащитен перед магом <b class="text-blue-700">воды</b>.
`,
    [MagicType.Air]: `Авенор буквально витает в облаках. Он считает себя джедаем и верит, что может управлять Силой. Любит цитировать Оби-Вана Кеноби и всем доказывает что только только он один умеет круче всех летать на метле. Но никто не видит чтобы он летал на метле, но регулярно можно видеть, как метла буквально прилетает ему в руки, чтобы подмести двор!<br><br>

Может пробить щит мага <b class="text-amber-700">земли</b><br>
Получает усиление от мага <b class="text-amber-700">земли</b><br>
Беззащитен перед магом <b class="text-red-700">огня</b>

`,
    [MagicType.Earth]: `Эавендиль мнит себя величественным эльфом, пришедшим прямо из Средиземья. Но где вы видели эльфов, под которыми раз в полгода ломается кресло? Наверное орки подпилили, не иначе. Эавендиль по-эльфийски высокомерен, но если периодически волшебник Пендальф проводит ритуал, в результате которого эльф становится чрезвычайно альтруистичен.<br><br> 

Может пробить щит мага <b class="text-blue-700">воды</b><br>
Получает усиление от мага <b class="text-red-700">огня</b> <br>
Беззащитен перед магом <b class="text-slate-700">воздуха</b>

`,
    [MagicType.Water]: `Варданон очень неразборчиво говорит. Как-будто булькает. Его дипломные работы можно было не просто выжимать, но там даже рыбы плавали! И доедали остатки смысла дипломной работы. А ещё Варданону очень не нравятся йогурты фирмы Данон. <br></br>

Может пробить щит мага <b class="text-red-700">огня</b><br>
Получает усиление от мага <b class="text-slate-700">воздуха</b><br>
Беззащитен перед магом <b class="text-amber-700">земли</b><br>

`,
  },
};
